import time
def Bubble_sorting2(a): 
    b = True 
    # 2 способ оптимизации метода пузырьковой сортировки
    c = 0 
    while(b): 
        b = False 
        for i in range(len(a) - c - 1): 
            if a[i] > a[i+1]: 
                a[i], a[i+1] = a[i+1], a[i] 
                b = True 
        c += 1 
    print("Количество элементов в списке: ",c) 
    return a 
a = [5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1, 5, 3, 8, 6, 7, 2, 1]  
print("Исходнные значения: ", a) 
start = time.time()
print("Значения после сортировки: ", Bubble_sorting2(a))
end = time.time()
print(end - start)
# 0.0009999275207519531